Table of Contents
 Class ConnectionData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides data of the connection
public class ConnectionData
Inheritance
object
ConnectionData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AnchorGrids
Anchor grids which belongs to the connection
public List<AnchorGrid> AnchorGrids { get; set; }
Property Value
List<AnchorGrid>
 Beams
Connected beams
public List<BeamData> Beams { get; set; }
Property Value
List<BeamData>
 BoltGrids
Bolt grids which belongs to the connection
public List<BoltGrid> BoltGrids { get; set; }
Property Value
List<BoltGrid>
 ConcreteBlocks
ConcreteBlocksof the connection
public List<ConcreteBlockData> ConcreteBlocks { get; set; }
Property Value
List<ConcreteBlockData>
 ConenctionPointId
Connection Point Id
[DataMember]
public int ConenctionPointId { get; set; }
Property Value
int
 CutBeamByBeams
cut beam by beams
public List<CutBeamByBeamData> CutBeamByBeams { get; set; }
Property Value
List<CutBeamByBeamData>
 FoldedPlates
Folded plate of the connection
public List<FoldedPlateData> FoldedPlates { get; set; }
Property Value
List<FoldedPlateData>
 Plates
Plates of the connection
public List<PlateData> Plates { get; set; }
Property Value
List<PlateData>
 Welds
Welds of the connection
public List<WeldData> Welds { get; set; }
Property Value
List<WeldData>
 Edit this page